---
kind: other
id: Properties.T:Autodesk.Revit.DB.Architecture.TopographySurface
source: html/ff4fa8e2-66f0-5698-d3ae-f8564847b6b0.htm
---
# TopographySurface Properties

Identifies whether the points of this topography surface can be edited independently.
 Topography surfaces created from external data will not allow editing of individual points.